In [ ]:
!pip install mysql-connector-python

In [1]:
import mysql.connector
connection = mysql.connector.connect(
    host="127.0.0.1",     
    user="root",         
    password="2011DongBaLiem@" )
cursor=connection.cursor()
cursor.execute("""CREATE SCHEMA if not exists quanlybanhangday36; """)

In [6]:
cursor.execute("USE quanlybanhangday36;")

In [5]:
connection = mysql.connector.connect(
    host="127.0.0.1",     
    user="root",         
    password="2011DongBaLiem@" ,
    database= "quanlybanhangday36")

cursor = connection.cursor()
cursor.execute("""
create table if not exists Products(
    ProductID int primary key ,
    Productname varchar(100) not null,
    Category varchar(50) not null,
    Price decimal(10,2) not null,
    StockQuantity int not null) ENGINE=InnoDB;
""")
cursor.execute("""
create table if not exists Customers(
    CustomerID int primary key ,
    Fullname varchar(100) not null,
    Phonenumber varchar(15) unique not null,
    Email varchar(100) unique not null) ENGINE=InnoDB;
""")
cursor.execute("""
create table if not exists Salespersons(
    SalespersonID int primary key ,
    Fullname varchar(100) not null,
    Phonenumber varchar(15) unique not null)ENGINE=InnoDB;
""")
cursor.execute(""" 
create table if not exists Orders( 
    OrderID int primary key ,
    CustomerID int not null,
    SalespersonID int not null,
    Orderdate date not null,
    Totalamount decimal(10,2),
    foreign key(CustomerID) references Customers(CustomerID) ON DELETE CASCADE,
    foreign key(SalespersonID) references Salespersons(SalespersonID) ON DELETE CASCADE )ENGINE=InnoDB;
""")
cursor.execute(""" 
create table if not exists Orderdetails(
    OrderdetailID int primary key ,
    OrderID int not null,
    ProductID int not null,
    Quantity int not null,
    Subtotal decimal(10,2),
    foreign key(OrderID) references Orders(OrderID) ON DELETE CASCADE,
    foreign key(ProductID) references Products(ProductID) ON DELETE CASCADE )ENGINE=InnoDB;
""")
cursor.execute("""
    UPDATE Orderdetails od
    JOIN Products p ON od.ProductID = p.ProductID
    SET od.Subtotal = od.Quantity * p.Price;
""")
connection.commit()

In [7]:
cursor.execute("""
INSERT INTO Products VALUES
    (1, 'Laptop Dell XPS', 'Laptop', 25000000, 10),
    (2, 'iPhone 14', 'Điện thoại', 22000000, 15),
    (3, 'Tai nghe Sony', 'Phụ kiện', 3000000, 20),
    (4, 'Bàn phím Cơ', 'Phụ kiện', 1500000, 50),
    (5, 'MacBook Air M2', 'Laptop', 28000000, 8);
""")
connection.commit()

In [9]:
cursor.execute("""
INSERT INTO Customers (CustomerID, Fullname, Phonenumber,Email) VALUES
    (1, 'Nguyễn Văn A', '0987654321', 'a@example.com'),
    (2, 'Trần Thị B', '0976543210', 'b@example.com'),
    (3, 'Lê Văn C', '0965432109', 'c@example.com'),
    (4, 'Phạm Thị D', '0945678123', 'd@example.com'),
    (5, 'Bùi Văn E', '0936789123', 'e@example.com');
""")
connection.commit()

In [11]:
cursor.execute("""
INSERT INTO Salespersons (SalespersonID, Fullname, Phonenumber) VALUES
    (1, 'Lê Hoàng Nam', '0934567890'),
    (2, 'Trần Quốc Bảo', '0945678123'),
    (3, 'Nguyễn Minh Hà', '0956789123');
""")
connection.commit()

In [12]:
cursor.execute("""
INSERT INTO Orders (OrderID, CustomerID, SalespersonID, Orderdate,Totalamount) VALUES
    (1, 1, 1, '2024-03-10', 25000000),
    (2, 2, 2, '2024-03-11', 3000000),
    (3, 3, 3, '2024-03-12', 22000000);
""")
connection.commit()

In [13]:
cursor.execute("""
INSERT INTO OrderDetails (OrderDetailID, OrderID, ProductID, Quantity) VALUES
    (1, 1, 1, 1),
    (2, 2, 3, 1),
    (3, 3, 2, 1);
""")
connection.commit()

In [23]:
cursor.execute("""
    UPDATE Orderdetails od
    JOIN Products p ON od.ProductID = p.ProductID
    SET od.Subtotal = od.Quantity * p.Price;
""")
connection.commit()

In [24]:
data=pd.read_sql_query("select * from OrderDetails""", connection)
data

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\3634266846.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data=pd.read_sql_query("select * from OrderDetails""", connection)

   OrderdetailID  OrderID  ProductID  Quantity    Subtotal
0              1        1          1         1  25000000.0
1              2        2          3         1   3000000.0
2              3        3          2         1  22000000.0

In [14]:
import pandas as pd

In [15]:
query="""
select * from Products where StockQuantity >0; """
connection.commit()
data=pd.read_sql_query(query, connection)
data

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\2287550278.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data=pd.read_sql_query(query, connection)

   ProductID      Productname    Category       Price  StockQuantity
0          1  Laptop Dell XPS      Laptop  25000000.0             10
1          2        iPhone 14  Điện thoại  22000000.0             15
2          3    Tai nghe Sony    Phụ kiện   3000000.0             20
3          4      Bàn phím Cơ    Phụ kiện   1500000.0             50
4          5   MacBook Air M2      Laptop  28000000.0              8

In [16]:
query="""
select * FROM Orders WHERE CustomerID = 1;
"""
connection.commit()
data = pd.read_sql_query(query,connection)
data

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\878240115.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql_query(query,connection)

   OrderID  CustomerID  SalespersonID   Orderdate  Totalamount
0        1           1              1  2024-03-10   25000000.0

In [17]:
query="""
SELECT SalespersonID, SUM(TotalAmount) AS TotalSales
FROM Orders
GROUP BY SalespersonID; """
connection.commit()
data = pd.read_sql_query(query,connection)
data

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\3009702821.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql_query(query,connection)

   SalespersonID  TotalSales
0              1  25000000.0
1              2   3000000.0
2              3  22000000.0

In [18]:
query = """
SELECT FullName, Sum(TotalAmount) AS Total_Sales FROM Orders
JOIN Salespersons ON Salespersons.SalespersonID = Orders.SalespersonID
GROUP BY Orders.SalespersonID;
"""
connection.commit()
data = pd.read_sql_query(query,connection)
data

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\207458887.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql_query(query,connection)

         FullName  Total_Sales
0    Lê Hoàng Nam   25000000.0
1   Trần Quốc Bảo    3000000.0
2  Nguyễn Minh Hà   22000000.0

In [19]:
query = """
SELECT FullName, Sum(TotalAmount) AS Total_Sales FROM Orders
JOIN Salespersons ON Salespersons.SalespersonID = Orders.SalespersonID
GROUP BY Orders.SalespersonID
ORDER BY Total_Sales DESC
LIMIT 1;
"""
connection.commit()
data = pd.read_sql_query(query,connection)
data

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\1042252351.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql_query(query,connection)

       FullName  Total_Sales
0  Lê Hoàng Nam   25000000.0

In [25]:
query="""
select p.Category, Sum(od.SubTotal) as Totalsales_cat
from Products p 
join Orderdetails od ON p.ProductID = od.ProductID 
Group by p.Category; 
"""
connection.commit()
data=pd.read_sql_query(query, connection)
print(data)

     Category  Totalsales_cat
0      Laptop      25000000.0
1    Phụ kiện       3000000.0
2  Điện thoại      22000000.0

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\1986612218.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data=pd.read_sql_query(query, connection)

In [26]:
query="""
SELECT c.FullName, SUM(o.TotalAmount) AS TotalSpent
FROM Customers c
JOIN Orders o ON c.CustomerID = o.CustomerID
GROUP BY c.FullName
ORDER BY TotalSpent DESC
LIMIT 3; """
connection.commit()
data=pd.read_sql_query(query, connection)
print(data)

       FullName  TotalSpent
0  Nguyễn Văn A  25000000.0
1      Lê Văn C  22000000.0
2    Trần Thị B   3000000.0

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\1787393628.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data=pd.read_sql_query(query, connection)

In [27]:
query="""
SELECT MONTH(OrderDate) AS Month, YEAR(OrderDate) AS Year, 
       SUM(TotalAmount) AS Revenue
FROM Orders
GROUP BY YEAR(OrderDate), MONTH(OrderDate)
ORDER BY Revenue DESC
LIMIT 1;"""
connection.commit()
data=pd.read_sql_query(query, connection)
print(data)

   Month  Year     Revenue
0      3  2024  50000000.0

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\3991822496.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data=pd.read_sql_query(query, connection)

In [28]:
query="""
SELECT p.ProductName, SUM(od.Quantity) AS Totalquan
FROM Products p
JOIN OrderDetails od ON p.ProductID = od.ProductID
GROUP BY p.ProductName
ORDER BY Totalquan DESC
LIMIT 1; """
connection.commit()
data=pd.read_sql_query(query, connection)
print(data)

       ProductName  Totalquan
0  Laptop Dell XPS        1.0

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11160\1054925079.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data=pd.read_sql_query(query, connection)